## Pandas

In [1]:
import numpy as np
import pandas as pd

### You can create a series object with a list or numpy array or a dictionary

### Series with List

In [2]:
my_list = [i for i in range(0,5)]
my_index =[i for i in 'risha']

In [3]:
my_list, my_index

([0, 1, 2, 3, 4], ['r', 'i', 's', 'h', 'a'])

In [4]:
pd.Series(data=my_list, index=my_index)

r    0
i    1
s    2
h    3
a    4
dtype: int64

In [5]:
pd.Series(my_list)

0    0
1    1
2    2
3    3
4    4
dtype: int64

In [6]:
pd.Series(my_list,my_index)

r    0
i    1
s    2
h    3
a    4
dtype: int64

### Series with NumPy array

In [7]:
array = np.arange(0,5)

In [8]:
array, my_index

(array([0, 1, 2, 3, 4]), ['r', 'i', 's', 'h', 'a'])

In [9]:
pd.Series(data = array)

0    0
1    1
2    2
3    3
4    4
dtype: int32

In [10]:
pd.Series(data = array, index = my_index)

r    0
i    1
s    2
h    3
a    4
dtype: int32

### Series with Dictionary

In [11]:
dict1 = {'one':1,'two':2,'three':3,'four':4}

In [12]:
dict1

{'one': 1, 'two': 2, 'three': 3, 'four': 4}

In [13]:
ser1 = pd.Series(dict1)
ser1

one      1
two      2
three    3
four     4
dtype: int64

## Series can hold wide variety of datatypes

In [14]:
## strings
list1 = ['a','b','c','d']
list2 = [1,2,3,4]
ser2 = pd.Series(data= list1 , index= list2)
ser2

1    a
2    b
3    c
4    d
dtype: object

In [15]:
## holding functions
list1 = [sum,min,max,type,range]
list2 = ['sum','min','max','type','range']
ser3 = pd.Series(data=list1, index=list2)
ser3

sum      <built-in function sum>
min      <built-in function min>
max      <built-in function max>
type              <class 'type'>
range            <class 'range'>
dtype: object

## Grabbing data from series

In [16]:
ser2[1]

'a'

In [17]:
dict1 = {'Mumbai':100,'Delhi':200,'Kolkata':300,'Chennai':400,'Bengaluru':500}
ser1 = pd.Series(dict1)
ser2 = pd.Series({'Mumbai':100,'Kolkata':300,'Chennai':400,'Bengaluru':500})
ser3 = pd.Series({'Mumbai':100,'Delhi':200,'Kolkata':300,'Bengaluru':500})

In [18]:
ser1['Mumbai']

100

In [19]:
ser1

Mumbai       100
Delhi        200
Kolkata      300
Chennai      400
Bengaluru    500
dtype: int64

In [20]:
ser2

Mumbai       100
Kolkata      300
Chennai      400
Bengaluru    500
dtype: int64

In [21]:
ser3

Mumbai       100
Delhi        200
Kolkata      300
Bengaluru    500
dtype: int64

### Basic operations on Series

In [22]:
ser1 +  ser2

Bengaluru    1000.0
Chennai       800.0
Delhi           NaN
Kolkata       600.0
Mumbai        200.0
dtype: float64

In [23]:
ser2 + ser3

Bengaluru    1000.0
Chennai         NaN
Delhi           NaN
Kolkata       600.0
Mumbai        200.0
dtype: float64

## Basic functions and attributes

In [24]:
ser = ser2 + ser3
ser

Bengaluru    1000.0
Chennai         NaN
Delhi           NaN
Kolkata       600.0
Mumbai        200.0
dtype: float64

In [25]:
ser.isnull()

Bengaluru    False
Chennai       True
Delhi         True
Kolkata      False
Mumbai       False
dtype: bool

In [26]:
ser.notnull()

Bengaluru     True
Chennai      False
Delhi        False
Kolkata       True
Mumbai        True
dtype: bool

In [27]:
ser.size

5

In [28]:
ser.axes

[Index(['Bengaluru', 'Chennai', 'Delhi', 'Kolkata', 'Mumbai'], dtype='object')]

In [29]:
ser.values

array([1000.,   nan,   nan,  600.,  200.])

In [30]:
ser.empty

False

In [31]:
ser.max()

1000.0

In [32]:
ser.min()

200.0

In [33]:
ser.std()

400.0

In [34]:
ser.var()

160000.0

In [35]:
ser.sum()

1800.0

In [36]:
ser.mean()

600.0

In [37]:
ser.head(2)

Bengaluru    1000.0
Chennai         NaN
dtype: float64

In [38]:
ser.tail(3)

Delhi        NaN
Kolkata    600.0
Mumbai     200.0
dtype: float64

## Dataframes

### Creating a dataframe

In [39]:
rows = 'India Australia Japan US Russia England France Germany Bhutan Fiji'.split()
cols = 'c1 c2 c3 c4 c5 c6 c7 c8 c9 c10'.split()
data = np.random.randint(0,100,100).reshape(10,10)

In [40]:
rows

['India',
 'Australia',
 'Japan',
 'US',
 'Russia',
 'England',
 'France',
 'Germany',
 'Bhutan',
 'Fiji']

In [41]:
cols

['c1', 'c2', 'c3', 'c4', 'c5', 'c6', 'c7', 'c8', 'c9', 'c10']

In [42]:
data

array([[33, 35, 74, 85, 41,  4,  2,  9, 29, 33],
       [12, 26, 68, 60, 26, 64, 14, 13, 17, 29],
       [51, 35, 50, 60, 98, 35, 43, 43,  1, 42],
       [80, 87, 84, 63, 44, 76, 10, 12, 69, 49],
       [88, 77, 94, 12, 17, 62, 67, 69, 45,  9],
       [12, 90, 69, 60, 58, 83, 80, 40, 72, 95],
       [51, 59, 53,  9, 40, 88, 43, 77, 18, 90],
       [58, 58, 30, 95, 34, 53,  2, 99, 46, 24],
       [91, 82, 86, 25, 32, 44, 79, 79,  3, 54],
       [50, 13, 87, 68, 69,  2, 87,  6, 40, 23]])

In [43]:
df = pd.DataFrame(data=data, index=rows, columns=cols)

In [44]:
df

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
India      33  35  74  85  41   4   2   9  29   33
Australia  12  26  68  60  26  64  14  13  17   29
Japan      51  35  50  60  98  35  43  43   1   42
US         80  87  84  63  44  76  10  12  69   49
Russia     88  77  94  12  17  62  67  69  45    9
England    12  90  69  60  58  83  80  40  72   95
France     51  59  53   9  40  88  43  77  18   90
Germany    58  58  30  95  34  53   2  99  46   24
Bhutan     91  82  86  25  32  44  79  79   3   54
Fiji       50  13  87  68  69   2  87   6  40   23

 ## Getting data out of DataFrames

### Selecting columns

In [45]:
df['c1']

India        33
Australia    12
Japan        51
US           80
Russia       88
England      12
France       51
Germany      58
Bhutan       91
Fiji         50
Name: c1, dtype: int32

In [46]:
df[['c1','c2']]

           c1  c2
India      33  35
Australia  12  26
Japan      51  35
US         80  87
Russia     88  77
England    12  90
France     51  59
Germany    58  58
Bhutan     91  82
Fiji       50  13

### Selecting rows

In [47]:
df.loc['India']

c1     33
c2     35
c3     74
c4     85
c5     41
c6      4
c7      2
c8      9
c9     29
c10    33
Name: India, dtype: int32

In [48]:
df.iloc[3]

c1     80
c2     87
c3     84
c4     63
c5     44
c6     76
c7     10
c8     12
c9     69
c10    49
Name: US, dtype: int32

In [49]:
df.loc[['India','England','Russia']]

         c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
India    33  35  74  85  41   4   2   9  29   33
England  12  90  69  60  58  83  80  40  72   95
Russia   88  77  94  12  17  62  67  69  45    9

### Selecting subset of a dataframe

In [50]:
df

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
India      33  35  74  85  41   4   2   9  29   33
Australia  12  26  68  60  26  64  14  13  17   29
Japan      51  35  50  60  98  35  43  43   1   42
US         80  87  84  63  44  76  10  12  69   49
Russia     88  77  94  12  17  62  67  69  45    9
England    12  90  69  60  58  83  80  40  72   95
France     51  59  53   9  40  88  43  77  18   90
Germany    58  58  30  95  34  53   2  99  46   24
Bhutan     91  82  86  25  32  44  79  79   3   54
Fiji       50  13  87  68  69   2  87   6  40   23

In [51]:
df.loc[['Japan','US','Russia'],['c5','c6','c7']]

        c5  c6  c7
Japan   98  35  43
US      44  76  10
Russia  17  62  67

### Adding a new column

In [52]:
df['c11'] = np.arange(0,10)

In [53]:
df

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  c11
India      33  35  74  85  41   4   2   9  29   33    0
Australia  12  26  68  60  26  64  14  13  17   29    1
Japan      51  35  50  60  98  35  43  43   1   42    2
US         80  87  84  63  44  76  10  12  69   49    3
Russia     88  77  94  12  17  62  67  69  45    9    4
England    12  90  69  60  58  83  80  40  72   95    5
France     51  59  53   9  40  88  43  77  18   90    6
Germany    58  58  30  95  34  53   2  99  46   24    7
Bhutan     91  82  86  25  32  44  79  79   3   54    8
Fiji       50  13  87  68  69   2  87   6  40   23    9

### Adding a new row

In [54]:
df.loc['Poland'] = np.random.randint(0,100,11)

In [55]:
df

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  c11
India      33  35  74  85  41   4   2   9  29   33    0
Australia  12  26  68  60  26  64  14  13  17   29    1
Japan      51  35  50  60  98  35  43  43   1   42    2
US         80  87  84  63  44  76  10  12  69   49    3
Russia     88  77  94  12  17  62  67  69  45    9    4
England    12  90  69  60  58  83  80  40  72   95    5
France     51  59  53   9  40  88  43  77  18   90    6
Germany    58  58  30  95  34  53   2  99  46   24    7
Bhutan     91  82  86  25  32  44  79  79   3   54    8
Fiji       50  13  87  68  69   2  87   6  40   23    9
Poland     72  45  96  92  63  44  85  75  29   68   85

### Dropping a column

In [56]:
df.drop('c11', axis=1)

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10
India      33  35  74  85  41   4   2   9  29   33
Australia  12  26  68  60  26  64  14  13  17   29
Japan      51  35  50  60  98  35  43  43   1   42
US         80  87  84  63  44  76  10  12  69   49
Russia     88  77  94  12  17  62  67  69  45    9
England    12  90  69  60  58  83  80  40  72   95
France     51  59  53   9  40  88  43  77  18   90
Germany    58  58  30  95  34  53   2  99  46   24
Bhutan     91  82  86  25  32  44  79  79   3   54
Fiji       50  13  87  68  69   2  87   6  40   23
Poland     72  45  96  92  63  44  85  75  29   68

### Dropping a row

In [57]:
df.drop('Poland',axis=0)

           c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  c11
India      33  35  74  85  41   4   2   9  29   33    0
Australia  12  26  68  60  26  64  14  13  17   29    1
Japan      51  35  50  60  98  35  43  43   1   42    2
US         80  87  84  63  44  76  10  12  69   49    3
Russia     88  77  94  12  17  62  67  69  45    9    4
England    12  90  69  60  58  83  80  40  72   95    5
France     51  59  53   9  40  88  43  77  18   90    6
Germany    58  58  30  95  34  53   2  99  46   24    7
Bhutan     91  82  86  25  32  44  79  79   3   54    8
Fiji       50  13  87  68  69   2  87   6  40   23    9

## Conditional Selection

In [58]:
df >=50

,c1,c2,c3,c4,c5,c6,c7,c8,c9,c10,c11
India,False,False,True,True,False,False,False,False,False,False,False
Australia,False,False,True,True,False,True,False,False,False,False,False
Japan,True,False,True,True,True,False,False,False,False,False,False
US,True,True,True,True,False,True,False,False,True,False,False
Russia,True,True,True,False,False,True,True,True,False,False,False
England,False,True,True,True,True,True,True,False,True,True,False
France,True,True,True,False,False,True,False,True,False,True,False
Germany,True,True,False,True,False,True,False,True,False,False,False
Bhutan,True,True,True,False,False,False,True,True,False,True,False
Fiji,True,False,True,True,True,False,True,False,False,False,False
Poland,True,False,True,True,True,False,True,True,False,True,True

In [59]:
df[df>=50]

             c1    c2    c3    c4    c5    c6    c7    c8    c9   c10   c11
India       NaN   NaN  74.0  85.0   NaN   NaN   NaN   NaN   NaN   NaN   NaN
Australia   NaN   NaN  68.0  60.0   NaN  64.0   NaN   NaN   NaN   NaN   NaN
Japan      51.0   NaN  50.0  60.0  98.0   NaN   NaN   NaN   NaN   NaN   NaN
US         80.0  87.0  84.0  63.0   NaN  76.0   NaN   NaN  69.0   NaN   NaN
Russia     88.0  77.0  94.0   NaN   NaN  62.0  67.0  69.0   NaN   NaN   NaN
England     NaN  90.0  69.0  60.0  58.0  83.0  80.0   NaN  72.0  95.0   NaN
France     51.0  59.0  53.0   NaN   NaN  88.0   NaN  77.0   NaN  90.0   NaN
Germany    58.0  58.0   NaN  95.0   NaN  53.0   NaN  99.0   NaN   NaN   NaN
Bhutan     91.0  82.0  86.0   NaN   NaN   NaN  79.0  79.0   NaN  54.0   NaN
Fiji       50.0   NaN  87.0  68.0  69.0   NaN  87.0   NaN   NaN   NaN   NaN
Poland     72.0   NaN  96.0  92.0  63.0   NaN  85.0  75.0   NaN  68.0  85.0

In [60]:
df[df['c1']>=50]

         c1  c2  c3  c4  c5  c6  c7  c8  c9  c10  c11
Japan    51  35  50  60  98  35  43  43   1   42    2
US       80  87  84  63  44  76  10  12  69   49    3
Russia   88  77  94  12  17  62  67  69  45    9    4
France   51  59  53   9  40  88  43  77  18   90    6
Germany  58  58  30  95  34  53   2  99  46   24    7
Bhutan   91  82  86  25  32  44  79  79   3   54    8
Fiji     50  13  87  68  69   2  87   6  40   23    9
Poland   72  45  96  92  63  44  85  75  29   68   85

In [61]:
df[df['c1']>=50].loc[['India','Bhutan']]

KeyError: 'Passing list-likes to .loc or [] with any missing labels is no longer supported, see https://pandas.pydata.org/pandas-docs/stable/user_guide/indexing.html#deprecate-loc-reindex-listlike'

In [ ]:
 df[(df>50) | (df%20==0)]

### Useful Methods

In [ ]:
### RESET INDEX
df.reset_index()

In [ ]:
df['new_ind'] = 'a b c d e f g h i j k'.split()

In [ ]:
df

In [ ]:
df.set_index('new_ind',inplace=True)

In [ ]:
df

In [ ]:
df.head()

In [ ]:
df.tail()

In [ ]:
df.info()

In [ ]:
df.describe()

## Hierarichal Indexing

In [ ]:
index = [['Asia','Asia','Asia','Europe','Europe','Europe','Africa','Africa','Africa'],
         ['Population','GDP','Gini','Population','GDP','Gini','Population','GDP','Gini'],
         [2010,2011,2012,2010,2011,2012,2010,2011,2012]]
data = np.random.randint(0,10,27).reshape(9,3)
cols = ['UN','World Bank','IMF']

In [ ]:
df = pd.DataFrame(data=data,index=index,columns=cols)

In [ ]:
df

In [ ]:
df.index.names

In [ ]:
df.index.names = ['Region','Parameter','Year']

In [ ]:
df

In [ ]:
df.loc['Asia'].loc[['GDP','Gini'],['UN','World Bank']]

In [ ]:
df['UN']

In [ ]:
df.xs(('Asia','GDP'))

In [ ]:
df.xs(key=('GDP',2011),level=['Parameter','Year'])

## Handling missing data

In [ ]:
## Creating a dataframe with a dictionary
df = pd.DataFrame({'India':[0,np.nan,2,3,4], 'China':[10,np.nan,12,13,np.nan], 'US':[np.nan,np.nan,np.nan,np.nan,np.nan],'Canada':[20,21,22,23,24]})

In [ ]:
df

In [ ]:
df.isnull()

In [ ]:
df.notnull()

In [ ]:
df.dropna()

In [ ]:
df.dropna(axis=1)

In [ ]:
df.dropna(thresh=2)

In [ ]:
df.fillna(20)

In [ ]:
df.fillna(method='ffill')

In [ ]:
df.fillna(method='bfill')

In [ ]:
df.fillna(method='pad')

## Merging and Concatenating

### Merging

In [ ]:
df1 = pd.DataFrame({'key':'a b c d e'.split(), 'X1':[1,2,3,4,5], 'X2':range(6,11)})
df2 = pd.DataFrame({'key':'a b c f g'.split(), 'X1':[1,2,3,11,12], 'X2':range(4,9)})

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.merge(df1,df2,how='inner',on='key')

In [ ]:
pd.merge(df1,df2,how='left',on='key')

In [ ]:
pd.merge(df1,df2,how='right',on='key')

In [ ]:
pd.merge(df1,df2,how='outer',on='key')

In [ ]:
left = pd.DataFrame({'key1': ['a', 'a', 'b', 'c'],
                     'key2': ['a', 'b', 'a', 'b'],
                     'A': ['A0', 'A1', 'A2', 'A3'],
                     'B': ['B0', 'B1', 'B2', 'B3']})
    
right = pd.DataFrame({'key1': ['a', 'b', 'b', 'c'],
                      'key2': ['a', 'b', 'a', 'a'],
                      'C': ['C0', 'C1', 'C2', 'C3'],
                      'D': ['D0', 'D1', 'D2', 'D3']})

In [ ]:
pd.merge(left,right,how='inner',on=['key1','key2'])

In [ ]:
pd.merge(left,right,how='right',on=['key1','key2'])

In [ ]:
pd.merge(left,right,how='left',on=['key1','key2'])

In [ ]:
pd.merge(left,right,how='outer',on=['key1','key2'])

### Concatenation

In [ ]:
df1 = pd.DataFrame({'A': ['A0', 'A1', 'A2', 'A3'],
                        'B': ['B0', 'B1', 'B2', 'B3'],
                        'C': ['C0', 'C1', 'C2', 'C3'],
                        'D': ['D0', 'D1', 'D2', 'D3']},
                        index=[0, 1, 2, 3])

In [ ]:
df2 = pd.DataFrame({'A': ['A4', 'A5', 'A6', 'A7'],
                        'B': ['B4', 'B5', 'B6', 'B7'],
                        'C': ['C4', 'C5', 'C6', 'C7'],
                        'D': ['D4', 'D5', 'D6', 'D7']},
                         index=[4,5,6,7])

In [ ]:
df1

In [ ]:
df2

In [ ]:
pd.concat([df1,df2],axis=1)

In [ ]:
pd.concat([df1,df2],axis=0)

## Group By

In [62]:
# Create a dataframe
data = {'Store':['Walmart','Walmart','Costco','Costco','Target','Target'],
       'Customer':['Tim','Jermy','Mark','Denice','Ray','Sam'],
       'Sales':[150,200,550,90,430,120]}
df = pd.DataFrame(data)
df

     Store Customer  Sales
0  Walmart      Tim    150
1  Walmart    Jermy    200
2   Costco     Mark    550
3   Costco   Denice     90
4   Target      Ray    430
5   Target      Sam    120

In [63]:
gb = df.groupby('Store')

In [64]:
gb

In [65]:
gb.sum()

         Sales
Store
Costco     640
Target     550
Walmart    350

In [66]:
gb.min()

        Customer  Sales
Store
Costco    Denice     90
Target       Ray    120
Walmart    Jermy    150

In [67]:
gb.max()

        Customer  Sales
Store
Costco      Mark    550
Target       Sam    430
Walmart      Tim    200

In [68]:
gb.std()

              Sales
Store
Costco   325.269119
Target   219.203102
Walmart   35.355339

In [69]:
gb.var()

          Sales
Store
Costco   105800
Target    48050
Walmart    1250

In [70]:
gb.count()

         Customer  Sales
Store
Costco          2      2
Target          2      2
Walmart         2      2

In [71]:
gb.mean()

         Sales
Store
Costco     320
Target     275
Walmart    175

In [72]:
gb.describe()

        Sales
        count   mean         std    min    25%    50%    75%    max
Store
Costco    2.0  320.0  325.269119   90.0  205.0  320.0  435.0  550.0
Target    2.0  275.0  219.203102  120.0  197.5  275.0  352.5  430.0
Walmart   2.0  175.0   35.355339  150.0  162.5  175.0  187.5  200.0

In [73]:
gb.describe().transpose()

Store            Costco      Target     Walmart
Sales count    2.000000    2.000000    2.000000
      mean   320.000000  275.000000  175.000000
      std    325.269119  219.203102   35.355339
      min     90.000000  120.000000  150.000000
      25%    205.000000  197.500000  162.500000
      50%    320.000000  275.000000  175.000000
      75%    435.000000  352.500000  187.500000
      max    550.000000  430.000000  200.000000

In [74]:
gb.describe().transpose()['Target']

Sales  count      2.000000
       mean     275.000000
       std      219.203102
       min      120.000000
       25%      197.500000
       50%      275.000000
       75%      352.500000
       max      430.000000
Name: Target, dtype: float64